Revit 2024 API
FacetingUtils Class
 This class is used to convertTrianglesToQuads a triangulated structure into a structure in which some of the triangles have been consolidated into quadrilaterals.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static class FacetingUtils
Visual Basic
Public NotInheritable Class FacetingUtils
Visual C++
public ref class FacetingUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FacetingUtils
See Also
FacetingUtils Members
Autodesk.Revit.DB Namespace